# Лекция 5 Input and output and Conditional Statements – задачи
#
# 1. Да се състави програма, чрез която се въвежда 4-цифренo естествено число от
# интервала [1000.. 9999]. От това число се формират 2 нови 2-цифрени числа. Първото
# число се формира от 1-та и 4-та цифра на въведеното число. Второто число се формира
# от 2-рa - 3-та цифра на въведеното число. На екрана да се изведе дали 1-то ново число
# e по-малко <, равно = или по-голямо от 2-то число.
# Използвайте проверка на логическо условие - оператор if.
# Пример: 3332 Изход: по-малко (32<33)
# Пример: 1144 Изход: равни (14=14)
# Пример: 9875 Изход: по-голямо (95>87)


# try:
#     number = int(input("Please provide a number between 1000 and 9999: "))
# except:
#     print("You did not provide a number between 1000 and 9999. Bye.")
# num1 = str((number // 1000)) + str((number % 10))
# num2 = str(((number % 1000)//100)) + str(((number % 100)//10))
#
#
# if int(num1) < int(num2):
#     print("По-малко( {} < {})".format(num1, num2))
# elif int(num1) > int(num2):
#     print("По-голямо( {} > {})".format(num1, num2))
# else:
#     print("Равни "
#           "( {} = {})".format(num1, num2))



# 2. Да се състави програма, чрез която се въвеждат 2 естествени двуцифрени
# числа a,b. Програмата да изведе съобщение дали последната цифра от произведението
# на двете числа е четна, както и самата цифра. Входни данни: a,b - естествени числа от
# интервала [10..99].
# Използвайте проверка на логическо условие - оператор if.
# Пример: 15, 25 Изход: 375, 5 нечетна


# a = int(input("Please add a 2-digit number: "))
# b = int(input("Please add a 2-digit number: "))
#
# number = a * b
# num1 = number % 10
# if number % 2 == 0:
#     print("{}, четна.". format(num1))
# else:
#     print("{}, нечетна.". format(num1))


# 3. Трябва да се напълни цистерна с вода. Имате 2 кофи с вместимост 2 и 3 литра
# и ги ползвате едновременно. Да се състави програма, която по въведен обем извежда
# как ще прелеете течността с тези кофи, т.е. по-колко пъти ще се пълни всяка от кофите.
# Входни данни: естествено число от интервала [10..9999].
# Използвайте проверка на логическо условие - оператор if.
# Пример: 107 Изход: 21 пъти 2-те кофи, допълнително кофа от 2 литра

# a = 2
# b = 3
#
# cisterna = int(input("Please provide size in liters: "))
# both_used = cisterna // (a + b)
# left_space = cisterna % (a + b)
#
# if left_space % 2 == 0:
#     left_to_add = int(left_space / 2)
#     print(f"{both_used} пъти 2-те кофи, допълнително {left_to_add} кофи от 2 литра.")
# elif left_space % 3 == 0:
#     left_to_add = int(left_space / 3)
#     print(f"{both_used} пъти 2-те кофи, допълнително {left_to_add} кофи от 3 литра.")
# else:
#     both_used1 = (cisterna // (a + b)) - 1
#     print(f"{both_used1} пъти 2-те кофи, допълнително 2 кофи от 3 литра.")      # В случай, че остатъкът е 1, нямаме такава кофа => вадим 1 кофа от 2 итра и, вместо нея добавяме трилитрова.



# 4. Съставете програма, която по въведено трицифренo число проверява дали
# числото се дели на всяка своя цифра. Във въведеното число да няма цифра 0.
# Използвайте проверка на логическо условие - оператор if.


# number = (int(input("Please provide a 3-digit number: ")))
#
# a = number // 100
# b = (number % 100) // 10
# c = number % 10
#
# if number % a == 0 and number % b == 0 and number % c == 0:
#     print(f"{number} се дели на {a}, {b} и {c}.")
# else:
#     print(f"{number} не се дели на {a}, {b} и {c}.")



# 5. Да се състави програма, която да изчислява периметър и площ на
# правоъгълник по въведени дължини на прилежащи страни - естествени числа от
# интервала [5 ..100]. Изведете съобщение, ако страните формират квадрат.
# Използвайте проверка на логическо условие - оператор if.
# Пример: 4,4 Изход: квадрат лице 16, периметър 16


# a = int(input("Plese provide the length of a. It should be between 5 and 100: "))
# b = int(input("Plese provide the length of b. It should be between 5 and 100: "))
#
# P = (2*a) + (2*b)
# S = a * b
#
# if a ==b:
#     print("Квадрат с лице {} и периметър {}.".format(S,P))
# else:
#     print("Правоъгълник с лице {} и периметър {}.".format(S, P))



# 6. Преди доста години имаше услуга - изпращане на луксозна телеграма.
# Поводи най-различни: рожден, имен ден, сватба и т.н. Цената се формираше по следния
# начин А: цена за бланка, B: цена за текст до 20 думи, C: цена за всяка дума, след първите
# 20 думи. Стойностите на A, B, C са реални числа от интервала [0.02..0.89]. Да се състави
# програма, чрез която по въведени брой думи, стойности за A, B, брой думи, C се
# изчислява крайна цена на луксозна телеграма.
# Пример: A=0.2, B=0.5, 45 думи, C=0.05 Изход: 1.95

# A = float(input("Въведете цената на бланката: "))
# B = float(input("Въведете цена а текст до 20 думи: "))
# C = float(input("Въведете цена на дума, след първите 20 думи: "))
# D = float(input("Въведете брой думи: "))
#
# if D - 20 > 0:
#     price = (A + B + ((D-20) * C))
#     print("Цената е {}.".format(price))
# else:
#     price = A + B
#     print("Цената е {}.".format(price))



# 7. . Високосни години са всички години кратни на 4 с изключения столетията, но
# без столетия кратни на 400, т.е. 1900 не е високосна, но 1600 и 2000 са високосни.
# Съставете програма, която по въведен ден, месец, година отпечатва следващата дата.
# Входни данни: естествени числа за ден, месец, година.
# Пример: 28, 2, 2000 Изход: 1,3,2000


# day = int(input("Please add the day: "))
# month = int(input("Please add the number of the month (1 - 12): "))
# year = int(input("Please add the year: "))
#
#
#
# if 1 < day < 28:
#      day +=1
# elif month != 2 and day == 28:
#     day += 1
# elif month % 2 != 0 and day == 30:
#     day += 1
# elif month == 2 and year % 4 == 0 and year % 100 != 0:
#     day +=1
# elif month == 2 and year % 4 == 0 and year % 100 == 1 and year % 400 == 0:
#     day += 1
# else:
#     day = day**0
#
#
# if day == 1:
#     month += 1
#
#
# if day == 1 and month == 13:
#     year += 1
#     month = month ** 0
#
#
# print(day, ",", month, ",", year)



# 8. Да се състави програма, която да отгатне колко е студено/топло по
# въведената температура в градус Целзий. Температурните интервали са: t <=-20 ледено
# студено; t <=0 && t>-20 студено; t <=15 && t>0 хладно; t <=25 && t>15 топло; t >25 горещо
# Входни данни: t - цяло число от интервала [-100..100].
# Пример: 12 Изход: хладно

# try:
#     t = int(input("Моля въведете температура в градуси по Целзий (- 100..100): "))
# except:
#     print("Не сте въвели температура.")
#     exit()
#
#
# if t <= -20:
#     print("Ледено студено.")
# elif -20 < t <= 0:
#     print("Студено.")
# elif 0 < t <= 15:
#     print("Хладно.")
# elif 15 < t <= 25:
#     print("Топло.")
# else:
#     print("Горещо.")


# 9. Да се състави програма, която да провери дали е възможно един
# правоъгълник да се вмести изцяло в друг правоъгълник.
# Входни данни: X1, Y1, X2, Y2 - страните на 2-та правоъгълника - естествени числа от
# интервала [5 ..100].


# a1 = float(input("Моля въведете дължина на страна \" a \" на първия правоъгълник: "))
# b1 = float(input("Моля въведете дължина на страна \" b \" на първия правоъгълник: "))
# print()
# a2 = float(input("Моля въведете дължина на страна \" a \" на втория правоъгълник: "))
# b2 = float(input("Моля въведете дължина на страна \" b \" на втория правоъгълник: "))
#
# if a1 < a2 and b1 < b2:
#     print("Вместват се.")
# elif a1 > a2 and b1 > b2:
#     print("Вместват се.")
# elif a1 < b2 and b1 < a2:
#     print("Вместват се.")
# elif a1 > b2 and b1 > a2:
#     print("Вместват се.")
# else:
#     print("Не се вместват.")


